; domain
(define (domain EMERGENCY_SERVICES_LOGISTICS)
  (:requirements :action-costs :strips :typing)
  (:types
    phys_object location crate_type num container - object
    helicopter victim crate carrier - phys_object
    helicopter carrier - container
    )
  (:constants
    depot - location


    n0 n1 n2 n3 n4 - num
    )
  (:predicates
    (at ?o - phys_object ?l - location)
    (has_crate ?v - victim ?t - crate_type)
    (contains ?h - container ?c - crate)
    (empty ?h - helicopter)
    (can_be_taken ?c - crate)
    (is_type ?c - crate ?t - crate_type)
    (nb_loaded_crates ?r - carrier ?n - num)

    (next ?numA - num ?numB - num)
    )

  (:functions
    (total-cost) - number
    (fly-cost ?from - location ?to - location) - number
    )

  (:action move
   :parameters (?h - helicopter ?from - location ?to - location)
   :precondition
   (and
    (at ?h ?from)
    )
   :effect
   (and
    (at ?h ?to)
    (not (at ?h ?from))
    (increase (total-cost) (fly-cost ?from ?to))
    )
   )

  (:action pick_up
   :parameters (?h - helicopter ?c - crate ?l - location)
   :precondition
   (and
    (at ?h ?l)
    (at ?c ?l)
    (empty ?h)
    (can_be_taken ?c))
   :effect 
   (and 
    (not
    (empty ?h))
    (not (can_be_taken ?c))
    (contains ?h ?c)
    (not (at ?c ?l))
    (increase (total-cost) 10)
    )
   )

  (:action give
   :parameters (?h - helicopter ?c - crate ?v - victim ?l - location ?t - crate_type)
   :precondition
   (and 
    (contains ?h ?c)
    (is_type ?c ?t)
    (at ?h ?l) (at ?v ?l)
    )
   :effect
   (and
    (empty ?h)
    (can_be_taken ?c)
    (not (contains ?h ?c))
    (has_crate ?v ?t)
    (increase (total-cost) 10)
    )
   )

  (:action load_crate_on_carrier
   :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
   :precondition
   (and
    (at ?h ?l)
    (at ?r ?l)
    (contains ?h ?c)
    (nb_loaded_crates ?r ?nb_loaded)
    (next ?nb_loaded ?new_nb_loaded)
    )
   :effect
   (and
     (not (nb_loaded_crates ?r ?nb_loaded))
     (nb_loaded_crates ?r ?new_nb_loaded)
     (not (contains ?h ?c))
     (contains ?r ?c)
     (increase (total-cost) 10)
     (empty ?h)
     )
   )

  (:action fly_carrier
    :parameters (?h - helicopter ?r - carrier ?from - location ?to - location)
    :precondition
    (and
      (empty ?h)
      (at ?h ?from)
      (at ?r ?from)
      )
    :effect
    (and
      (not (at ?h ?from)) (at ?h ?to)
      (not (at ?r ?from)) (at ?r ?to)
      (increase (total-cost) (fly-cost ?from ?to))
      )
    )

  (:action take_crate_from_carrier
    :parameters (?h - helicopter ?r - carrier ?c - crate ?l - location ?nb_loaded - num ?new_nb_loaded - num)
    :precondition
    (and
      (at ?h ?l)
      (at ?r ?l)
      (contains ?r ?c)
      (empty ?h)
      (nb_loaded_crates ?r ?nb_loaded)
      (next ?new_nb_loaded ?nb_loaded)
      )
    :effect
    (and
      (not (contains ?r ?c))
      (not (empty ?h))
      (contains ?h ?c)
      (not (nb_loaded_crates ?r ?nb_loaded)) (nb_loaded_crates ?r ?new_nb_loaded)
      (increase (total-cost) 10)
      )
    )
  )

; problem
(define (problem simple-problem-p4)
  (:domain EMERGENCY_SERVICES_LOGISTICS)

  (:objects
    p1 - victim
    p2 - victim
    p3 - victim
    p4 - victim
    l1 - location
    l2 - location
    l3 - location
    l4 - location
    c1 - crate
    c2 - crate
    c3 - crate
    c4 - crate

    r - carrier

    h - helicopter
    
    food_crate medicine_crate - crate_type
    )
  (:init
    (next n0 n1) (next n1 n2) (next n2 n3) (next n3 n4)
    (= (total-cost) 0)

    (at h depot)
    (at r depot)
    (at c1 depot)
    (at c2 depot)
    (at c3 depot)
    (at c4 depot)
    (at p1 l1)
    (at p2 l2)
    (at p3 l3)
    (at p4 l4)

    (empty h)

    (nb_loaded_crates r n0)

    (can_be_taken c1)
    (can_be_taken c2)
    (can_be_taken c3)
    (can_be_taken c4)

    (is_type c1 food_crate)
    (is_type c2 food_crate)
    (is_type c3 food_crate)
    (is_type c4 food_crate)

    (= (fly-cost depot depot) 1)
    (= (fly-cost depot l1) 100)
    (= (fly-cost depot l2) 100)
    (= (fly-cost depot l3) 100)
    (= (fly-cost depot l4) 100)
    (= (fly-cost l1 depot) 100)
    (= (fly-cost l1 l1) 1)
    (= (fly-cost l1 l2) 10)
    (= (fly-cost l1 l3) 10)
    (= (fly-cost l1 l4) 10)
    (= (fly-cost l2 depot) 100)
    (= (fly-cost l2 l1) 10)
    (= (fly-cost l2 l2) 1)
    (= (fly-cost l2 l3) 10)
    (= (fly-cost l2 l4) 10)
    (= (fly-cost l3 depot) 100)
    (= (fly-cost l3 l1) 10)
    (= (fly-cost l3 l2) 10)
    (= (fly-cost l3 l3) 1)
    (= (fly-cost l3 l4) 10)
    (= (fly-cost l4 depot) 100)
    (= (fly-cost l4 l1) 10)
    (= (fly-cost l4 l2) 10)
    (= (fly-cost l4 l3) 10)
    (= (fly-cost l4 l4) 1)
    )

  (:goal
    (and
     (at h depot)

     (has_crate p1 food_crate)
     (has_crate p2 food_crate)
     (has_crate p3 food_crate)
     (has_crate p4 food_crate)
     )
    )
  (:metric minimize (total-cost))
  )

; plan
1. (pick_up h c1 depot)
   deleted: (empty h) (can_be_taken c1) (at c1 depot)
   added: (contains h c1)
   goals met: 1 of 5
2. (load_crate_on_carrier h r c1 depot n0 n1)
   deleted: (nb_loaded_crates r n0) (contains h c1)
   added: (nb_loaded_crates r n1) (contains r c1) (empty h)
   goals met: 1 of 5
3. (pick_up h c2 depot)
   deleted: (empty h) (can_be_taken c2) (at c2 depot)
   added: (contains h c2)
   goals met: 1 of 5
4. (load_crate_on_carrier h r c2 depot n1 n2)
   deleted: (nb_loaded_crates r n1) (contains h c2)
   added: (nb_loaded_crates r n2) (contains r c2) (empty h)
   goals met: 1 of 5
5. (pick_up h c3 depot)
   deleted: (empty h) (can_be_taken c3) (at c3 depot)
   added: (contains h c3)
   goals met: 1 of 5
6. (load_crate_on_carrier h r c3 depot n2 n3)
   deleted: (nb_loaded_crates r n2) (contains h c3)
   added: (nb_loaded_crates r n3) (contains r c3) (empty h)
   goals met: 1 of 5
7. (pick_up h c4 depot)
   deleted: (empty h) (can_be_taken c4) (at c4 depot)
   added: (contains h c4)
   goals met: 1 of 5
8. (load_crate_on_carrier h r c4 depot n3 n4)
   deleted: (nb_loaded_crates r n3) (contains h c4)
   added: (nb_loaded_crates r n4) (contains r c4) (empty h)
   goals met: 1 of 5
9. (fly_carrier h r depot l1)
   deleted: (at h depot) (at r depot)
   added: (at h l1) (at r l1)
   goals met: 0 of 5
10. (take_crate_from_carrier h r c1 l1 n4 n3)
   deleted: (contains r c1) (empty h) (nb_loaded_crates r n4)
   added: (contains h c1) (nb_loaded_crates r n3)
   goals met: 0 of 5
11. (give h c1 p1 l1 food_crate)
   deleted: (contains h c1)
   added: (empty h) (can_be_taken c1) (has_crate p1 food_crate)
   goals met: 1 of 5
12. (fly_carrier h r l1 l2)
   deleted: (at h l1) (at r l1)
   added: (at h l2) (at r l2)
   goals met: 1 of 5
13. (take_crate_from_carrier h r c2 l2 n3 n2)
   deleted: (contains r c2) (empty h) (nb_loaded_crates r n3)
   added: (contains h c2) (nb_loaded_crates r n2)
   goals met: 1 of 5
14. (give h c2 p2 l2 food_crate)
   deleted: (contains h c2)
   added: (empty h) (can_be_taken c2) (has_crate p2 food_crate)
   goals met: 2 of 5
15. (fly_carrier h r l2 l3)
   deleted: (at h l2) (at r l2)
   added: (at h l3) (at r l3)
   goals met: 2 of 5
16. (take_crate_from_carrier h r c3 l3 n2 n1)
   deleted: (contains r c3) (empty h) (nb_loaded_crates r n2)
   added: (contains h c3) (nb_loaded_crates r n1)
   goals met: 2 of 5
17. (give h c3 p3 l3 food_crate)
   deleted: (contains h c3)
   added: (empty h) (can_be_taken c3) (has_crate p3 food_crate)
   goals met: 3 of 5
18. (take_crate_from_carrier h r c4 l3 n1 n0)
   deleted: (contains r c4) (empty h) (nb_loaded_crates r n1)
   added: (contains h c4) (nb_loaded_crates r n0)
   goals met: 3 of 5
19. (move h l3 l4)
   deleted: (at h l3)
   added: (at h l4)
   goals met: 3 of 5
20. (give h c4 p4 l4 food_crate)
   deleted: (contains h c4)
   added: (empty h) (can_be_taken c4) (has_crate p4 food_crate)
   goals met: 4 of 5
21. (move h l4 depot)
   deleted: (at h l4)
   added: (at h depot)
   goals met: 5 of 5
